import { Injectable } from '@angular/core';

@Injectable()
export class PostService {

  posts = [
      {
        title: 'ახალი პრადო საქართველოშია! რა შეიცვალა ტოიოტას ბესტსელერში?',
        text: '”ტოიოტა კავკასიამ” ახალი Land Cruiser Prado წარმოადგინა. საქართველოში სეგმენტის ბესტსელერი მოდელის ახალი ვერსიის პრეზენტაცია 7 ნოემბერს, შატო მუხრანის ტერიტორიაზე გაიმართა. \n' +
        '\n' +
        '”პრადო” მთელი მსოფლიოს მასშტაბით ერთ-ერთი ყველაზე პოპულარული მაღალი გამავლობის ავტომობილია, საქართველოში კი, უკვე წლებია, თავისი სეგმენტის ბესტსელერია. რა შეცვალეს იაპონელებმა განახლებულ ”პრადოში”? ყველა დროის ერთ-ერთი ყველაზე წარმატებული ყველგანმავალი ვიზუალურად კიდევ უფრო დაიხვეწა, ტექნიკური თვალსაზრისით კი, განვითარების სრულიად ახალ საფეხურზე ავიდა.\n' +
        '\n' +
        '”არა მარტო საქართველოში, არამედ მთელი მსოფლიოს მასშტაბით, ”ტოიოტა ლენდ კრუიზერ პრადო” თავის კლასში საუკეთესოა. დარწმუნებული ვარ, რომ ქართველი ხალხი ახალ \n' +
        '”პრადოსაც” კარგად მიიღებს და კიდევ უფრო მეტად შეიყვარებს,” - განაცხადა ”ტოიოტა კავკასიის” პრეზიდენტმა მიტსურუ კონიშიმ.',
        img: 'https://www.autobild.ge/pictures/image3/9d115b9bdbb8f54f0a298fb5c6440b42.jpg',
        created_at: new Date()
      },
            {
        title: 'როგორი იქნება ახალი ვოლგა?',
        text: `თქვენ უკვე იცით ე.წ. „კორტეჟის“ პროექტის შესახებ, რომელიც რუსეთის მაღალჩინოსნებისთვის ახალი წარმომადგენლობითი ავტომობილების შექმნას გულისხმობს. როგორც ირკვევა, მდიდრულ ლიმუზინებთან ერთად, დაგეგმილია შედარებით მოკრძალებული სედანების შექმნაც.
                ამ ახალ სედანებზე გორკის ავტოქარხანა მუშაობს, რაც იმას ნიშნავს, რომ ყველასათვის კარგად ნაცნობი „ვოლგა“ კიდევ ერთხელ დაიბადება თავიდან!
    სერიული მოდელამდე, რუსებმა კონცეპტი წარმოადგინეს, რომელსაც GAZ 5000 GL ეწოდება. ჯერჯერობით ნაჩვენებია პირველი ესკიზები, თუმცა უკვე შეიძლება, წარმოვიდგინოთ, დაახლოებით როგორი იქნება ახალი „ვოლგა“.`,
        img: 'https://www.autobild.ge/images/avtorebi/february/16/gaz-5000-gl-volga-1-570x363.jpg',
        created_at: new Date()
      },

  ];

  constructor() { }

  onAdd(post) {
      const p = {
          title: post.title,
          text: post.text,
          img: post.img,
          created_at: new Date()
      }
      this.posts.unshift(p);
  }

  onEdit(index, post) {
      const p = {
          title: post.title,
          text: post.text,
          img: post.img,
          created_at: new Date()
      }
      this.posts[index] = p;
  }

}
